[
	{
		"type": "group",
		"label": {
			"en": "Login details",
			"nl": "Inloggegevens",
			"da": "Login-oplysninger",
			"de": "Anmeldedaten",
			"es": "Detalles de inicio de sesión",
			"fr": "Détails de connexion",
			"it": "Dettagli di accesso",
			"no": "Innloggingsdetaljer",
			"sv": "Inloggningsuppgifter",
			"pl": "Dane logowania",
			"ru": "Детали входа",
			"ko": "로그인 정보"
		},
		"children": [
			{
				"id": "email",
				"type": "text",
				"label": {
					"en": "E-mail",
					"nl": "E-mailadres",
					"da": "E-mail",
					"de": "E-Mail",
					"es": "Correo electrónico",
					"fr": "E-mail",
					"it": "E-mail",
					"no": "E-post",
					"sv": "E-post",
					"pl": "E-mail",
					"ru": "Эл. почта",
					"ko": "이메일"
				},
				"value": "",
				"hint": {
					"en": "The e-mail that you use in the Volkswagen App.",
					"nl": "Het e-mailadres dat je gebruikt in de Volkswagen App.",
					"da": "E-mailen du bruger i Volkswagen App.",
					"de": "Die E-Mail, die Sie in der Volkswagen App verwenden.",
					"es": "El correo electrónico que utilizas en la aplicación de Volkswagen.",
					"fr": "L'e-mail que vous utilisez dans l'application Volkswagen.",
					"it": "L'e-mail che usi nell'app Volkswagen.",
					"no": "E-posten du bruker i Volkswagen-appen.",
					"sv": "E-posten du använder i Volkswagen-appen.",
					"pl": "E-mail, którego używasz w aplikacji Volkswagen.",
					"ru": "Электронная почта, которую вы используете в приложении Volkswagen.",
					"ko": "폭스바겐 앱에서 사용하는 이메일입니다."
				}
			},
			{
				"id": "password",
				"type": "password",
				"label": {
					"en": "Password",
					"nl": "Wachtwoord",
					"da": "Adgangskode",
					"de": "Passwort",
					"es": "Contraseña",
					"fr": "Mot de passe",
					"it": "Password",
					"no": "Passord",
					"sv": "Lösenord",
					"pl": "Hasło",
					"ru": "Пароль",
					"ko": "비밀번호"
				},
				"value": "",
				"hint": {
					"en": "The password that you use in the Volkswagen App.",
					"nl": "Het wachtwoord dat je gebruikt in de Volkswagen App.",
					"da": "Adgangskoden du bruger i Volkswagen App.",
					"de": "Das Passwort, das Sie in der Volkswagen App verwenden.",
					"es": "La contraseña que utilizas en la aplicación de Volkswagen.",
					"fr": "Le mot de passe que vous utilisez dans l'application Volkswagen.",
					"it": "La password che usi nell'app Volkswagen.",
					"no": "Passordet du bruker i Volkswagen-appen.",
					"sv": "Lösenordet du använder i Volkswagen-appen.",
					"pl": "Hasło, którego używasz w aplikacji Volkswagen.",
					"ru": "Пароль, который вы используете в приложении Volkswagen.",
					"ko": "폭스바겐 앱에서 사용하는 비밀번호입니다."
				}
			},
			{
				"id": "sPin",
				"type": "password",
				"label": {
					"en": "S-PIN",
					"nl": "S-PIN"
				},
				"value": "",
				"pattern": "^[0-9]{4}$",
				"hint": {
					"en": "Required to modify vehicle settings.",
					"nl": "Vereist om voertuiginstellingen te wijzigen.",
					"da": "Påkrævet for at ændre køretøjsindstillinger.",
					"de": "Erforderlich, um Fahrzeugeinstellungen zu ändern.",
					"es": "Requerido para modificar la configuración del vehículo.",
					"fr": "Nécessaire pour modifier les paramètres du véhicule.",
					"it": "Richiesto per modificare le impostazioni del veicolo.",
					"no": "Kreves for å endre kjøretøyinnstillinger.",
					"sv": "Krävs för att ändra fordonsinställningar.",
					"pl": "Wymagane do modyfikacji ustawień pojazdu.",
					"ru": "Необходимо для изменения настроек автомобиля.",
					"ko": "차량 설정을 수정하려면 필요합니다."
				}
			}
		]
	},
	{
		"type": "group",
		"label": {
			"en": "Behavior settings",
			"nl": "Gedragsinstellingen",
			"da": "Adfærdsindstillinger",
			"de": "Verhaltenseinstellungen",
			"es": "Ajustes de comportamiento",
			"fr": "Paramètres de comportement",
			"it": "Impostazioni di comportamento",
			"no": "Adferdsinnstillinger",
			"sv": "Beteendeinställningar",
			"pl": "Ustawienia zachowania",
			"ru": "Настройки поведения",
			"ko": "동작 설정"
		},
		"children": [
			{
				"id": "pollingInterval",
				"type": "number",
				"label": {
					"en": "Polling interval",
					"nl": "Ververstijd",
					"da": "Afstemningsinterval",
					"de": "Abrufintervall",
					"es": "Intervalo de sondeo",
					"fr": "Intervalle d'interrogation",
					"it": "Intervallo di polling",
					"no": "Polling-intervall",
					"sv": "Intervall för avstämning",
					"pl": "Interwał odpytywania",
					"ru": "Интервал опроса",
					"ko": "폴링 간격"
				},
				"value": 10,
				"min": 1,
				"step": 1,
				"units": {
					"en": "minutes",
					"nl": "minuten",
					"da": "minutter",
					"de": "Minuten",
					"es": "minutos",
					"fr": "minutes",
					"it": "minuti",
					"no": "minutter",
					"sv": "minuter",
					"pl": "minuty",
					"ru": "минуты",
					"ko": "분"
				},
				"hint": {
					"en": "Interval in minutes to poll the vehicle for new data. Lowering this value may result in battery drain.",
					"nl": "Interval in minuten om bijgewerkte gegevens op te halen. Het verlagen van deze waarde kan resulteren in hoger batterijgebruik.",
					"da": "Interval i minutter for at afstemme køretøjet for nye data. At sænke denne værdi kan resultere i batteridræn.",
					"de": "Intervall in Minuten, um das Fahrzeug auf neue Daten abzufragen. Eine Verringerung dieses Wertes kann zu einem Batterieverbrauch führen.",
					"es": "Intervalo en minutos para sondear el vehículo por nuevos datos. Reducir este valor puede resultar en el agotamiento de la batería.",
					"fr": "Intervalle en minutes pour interroger le véhicule pour de nouvelles données. Diminuer cette valeur peut entraîner une décharge de la batterie.",
					"it": "Intervallo in minuti per sondare il veicolo per nuovi dati. Abbassare questo valore può causare lo scaricamento della batteria.",
					"no": "Intervall i minutter for å avstemme kjøretøyet for nye data. Å senke denne verdien kan føre til batteritap.",
					"sv": "Intervall i minuter för att stämma av fordonet för ny data. Att sänka detta värde kan leda till batteridränering.",
					"pl": "Interwał w minutach do odpytywania pojazdu o nowe dane. Obniżenie tej wartości może prowadzić do rozładowania akumulatora.",
					"ru": "Интервал в минутах для опроса автомобиля на наличие новых данных. Уменьшение этого значения может привести к разрядке аккумулятора.",
					"ko": "새 데이터를 위해 차량을 폴링하는 간격(분). 이 값을 낮추면 배터리가 소모될 수 있습니다."
				}
			},
			{
				"id": "enableLogging",
				"type": "checkbox",
				"label": {
					"en": "Enable logging",
					"nl": "Loggen inschakelen",
					"da": "Aktivér logning",
					"de": "Protokollierung aktivieren",
					"es": "Habilitar registro",
					"fr": "Activer la journalisation",
					"it": "Abilita registrazione",
					"no": "Aktiver logging",
					"sv": "Aktivera loggning",
					"pl": "Włącz rejestrowanie",
					"ru": "Включить ведение журнала",
					"ko": "로깅 활성화"
				},
				"value": false,
				"hint": {
					"en": "When enabled, logs all vehicle data to Homey. This data is only included in diagnostics reports if you create one, making it easier to debug issues. Logging is optional and can only be read by the developer if a diagnostics report is sent. Errors are always logged and do not contain user data.",
					"nl": "Wanneer ingeschakeld, worden alle voertuiggegevens gelogd naar Homey. Deze gegevens worden toegevoegd aan diagnostische rapporten als je die aanmaakt, waardoor eventuele problemen die je ervaart gemakkelijker op te lossen zijn. Loggen is optioneel en kan alleen door de ontwikkelaar worden gelezen als je diagnostisch rapport verzendt. Crashes worden altijd gelogd en bevatten geen persoonsgegevens.",
					"da": "Når aktiveret, logger alle køretøjsdata til Homey. Disse data inkluderes kun i diagnostiske rapporter, hvis du opretter en, hvilket gør det lettere at fejlfinde problemer. Logning er valgfri og kan kun læses af udvikleren, hvis en diagnostisk rapport sendes. Fejl logges altid og indeholder ikke brugerdata.",
					"de": "Wenn aktiviert, werden alle Fahrzeugdaten in Homey protokolliert. Diese Daten werden nur in Diagnoseberichte aufgenommen, wenn Sie einen erstellen, was die Fehlersuche erleichtert. Die Protokollierung ist optional und kann nur vom Entwickler gelesen werden, wenn ein Diagnosebericht gesendet wird. Fehler werden immer protokolliert und enthalten keine Benutzerdaten.",
					"es": "Cuando está habilitado, registra todos los datos del vehículo en Homey. Estos datos solo se incluyen en informes de diagnóstico si creas uno, facilitando la depuración de problemas. El registro es opcional y solo puede ser leído por el desarrollador si se envía un informe de diagnóstico. Los errores siempre se registran y no contienen datos de usuario.",
					"fr": "Lorsqu'elle est activée, enregistre toutes les données du véhicule dans Homey. Ces données ne sont incluses dans les rapports de diagnostic que si vous en créez un, ce qui facilite le débogage des problèmes. La journalisation est facultative et ne peut être lue par le développeur que si un rapport de diagnostic est envoyé. Les erreurs sont toujours enregistrées et ne contiennent pas de données utilisateur.",
					"it": "Quando abilitato, registra tutti i dati del veicolo su Homey. Questi dati vengono inclusi solo nei rapporti diagnostici se ne crei uno, rendendo più facile il debug dei problemi. La registrazione è facoltativa e può essere letta solo dallo sviluppatore se viene inviato un rapporto diagnostico. Gli errori vengono sempre registrati e non contengono dati utente.",
					"no": "Når aktivert, logger alle kjøretøydata til Homey. Disse dataene inkluderes kun i diagnostiske rapporter hvis du oppretter en, noe som gjør det enklere å feilsøke problemer. Logging er valgfritt og kan bare leses av utvikleren hvis en diagnostisk rapport sendes. Feil logges alltid og inneholder ikke brukerdata.",
					"sv": "När den är aktiverad loggas alla fordonsdata till Homey. Dessa data inkluderas endast i diagnostiska rapporter om du skapar en, vilket gör det lättare att felsöka problem. Loggning är valfritt och kan endast läsas av utvecklaren om en diagnostisk rapport skickas. Fel loggas alltid och innehåller inte användardata.",
					"pl": "Po włączeniu rejestruje wszystkie dane pojazdu w Homey. Te dane są uwzględniane tylko w raportach diagnostycznych, jeśli je utworzysz, co ułatwia debugowanie problemów. Rejestrowanie jest opcjonalne i może być odczytane tylko przez dewelopera, jeśli zostanie wysłany raport diagnostyczny. Błędy są zawsze rejestrowane i nie zawierają danych użytkownika.",
					"ru": "При включении регистрирует все данные автомобиля в Homey. Эти данные включаются только в диагностические отчеты, если вы их создаете, что упрощает отладку проблем. Ведение журнала является необязательным и может быть прочитано разработчиком только в случае отправки диагностического отчета. Ошибки всегда регистрируются и не содержат пользовательских данных.",
					"ko": "활성화하면 모든 차량 데이터를 Homey에 기록합니다. 이 데이터는 진단 보고서를 만들 때만 포함되어 문제를 더 쉽게 디버그할 수 있습니다. 로깅은 선택 사항이며 진단 보고서가 전송되는 경우에만 개발자가 읽을 수 있습니다. 오류는 항상 기록되며 사용자 데이터를 포함하지 않습니다."
				}
			}
		]
	}
]
